frontend/controllers/SiteController.php

    public function actionLogin()
    {
        //$this->layout = 'InnerPage';

        if (!Yii::$app->user->isGuest) {
            return $this->redirect(['site/dashboard']);
        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post()) && $model->login()) {
             $usermodel = new UserMast();

             $userdata = UserMast::find()->where(['id'=>Yii::$app->user->id])->one();
---
SELECT * FROM `user_mast` WHERE `id`=6

    public function actionJudgment()
    {

        $params = \Yii::$app->request->get();

        /*
         * check code prameter passed
         */
        $username = \Yii::$app->user->identity->username;
        if(!empty($params) && isset($params["id"]) && !empty($params["id"]) && intval($params['id']) > 0){
            $params["judgment_code"]=$params["id"];
            $params1["doc_id"] = $params["id"];
            $data = JudgmentMast::getSearchJudgment($params["judgment_code"]);
            $user_log = new BrowsingLog();
            $uri = $_SERVER['REQUEST_URI'];// Outputs: URI(w/o http or https)
            $protocol = ((!empty($_SERVER['HTTPS']) && $_SERVER['HTTPS'] != 'off') || $_SERVER['SERVER_PORT'] == 443) ? "https://" : "http://";
            $url = $protocol . $_SERVER['HTTP_HOST'] . $uri;// Outputs: Full URL
            $user_log->username = $username;
            $user_log->browse_url = $url;
            $user_log->save();
---
INSERT INTO `browsing_log` (`username`, `browse_url`) VALUES ('pooja@laxyosolutionsoft.com', 'http://localhost/legal_mix//site/judgment/1')

     public function actionDashboard()
     {
         //$this->layout = 'InnerPage';

         $id = Yii::$app->user->identity->id;
         $model = UserMast::findOne($id);
         $username = \Yii::$app->user->identity->username;
            $user_log = new BrowsingLog();
            $uri = $_SERVER['REQUEST_URI'];// Outputs: URI(w/o http or https)
            $protocol = ((!empty($_SERVER['HTTPS']) && $_SERVER['HTTPS'] != 'off') || $_SERVER['SERVER_PORT'] == 443) ? "https://" : "http://";
            $url = $protocol . $_SERVER['HTTP_HOST'] . $uri;// Outputs: Full URL
            $user_log->username = $username;
            $user_log->browse_url = $url;
            $user_log->save();
---
SELECT * FROM `user_mast` WHERE `id`=6
INSERT INTO `browsing_log` (`username`, `browse_url`) VALUES ('pooja@laxyosolutionsoft.com', 'http://localhost/legal_mix//site/dashboard')

       public function actionBareactDesc($act_sub)
     {
           //$barMast = new BareactMast();
           //$barDesc = $barMast->getbareactDesc($act_sub);
          $query = BareactMast::find()->where(['act_sub_catg_code' => $act_sub])->orderBy('bareact_desc');
          $countQuery = clone $query;
          $pages = new Pagination(['totalCount' => $countQuery->count(),'defaultPageSize'=>'10']);
          $barDesc = $query->offset($pages->offset)
          ->limit($pages->limit)
          ->all();
---
SELECT COUNT(*) FROM `bareact_mast` WHERE `act_sub_catg_code`='150'
SELECT * FROM `bareact_mast` WHERE `act_sub_catg_code`='150' ORDER BY `bareact_desc` LIMIT 10

       public function actionBareactTitle($bar_code)
     {
           //$barDetl = new BareactDetl();
           //$barTitle = $barDetl->getbareactTitle($bar_code);
           $query = BareactDetl::find()->where(['bareact_code'=>$bar_code])->orderBy('sno,level');
           $countQuery = clone $query;
           $pages = new Pagination(['totalCount' => $countQuery->count(),'defaultPageSize'=>'10']);
           $barTitle = $query->offset($pages->offset)
          ->limit($pages->limit)
          ->all();
---
SELECT COUNT(*) FROM `bareact_detl` WHERE `bareact_code`='1751'
SELECT * FROM `bareact_detl` WHERE `bareact_code`='1751' ORDER BY `sno`, `level` LIMIT 10 OFFSET 370

      public function actionBareactFinal($id)
    {

         $bareact = BareactMast::find()->select(['doc_id'])->where(['bareact_code'=>$id])->one();
         $bareactmast_docid = $bareact['doc_id'];
         $query = BareactDetl::find()->select('body')->where(['=','doc_id',$bareactmast_docid])->one();
---
SELECT `doc_id` FROM `bareact_mast` WHERE `bareact_code`='35'
SELECT `body` FROM `bareact_detl` WHERE `doc_id` = 1033710

public function actionStep2()
{
         $this->layout = 'mainstep2';
         $id = Yii::$app->user->identity->id;

         Yii::$app->params['uploadPath'] = Yii::$app->basePath . '/web/images/uploads/';
         $user = new LoginForm();
         $model = UserMast::findOne($id);
---
SELECT * FROM `user_mast` WHERE `id`=6