common/models/JudgmentMastSphinxSearch.php

SELECT `judgment_mast`.`appeal_numb`, `judgment_mast`.`judgment_title`, `judgment_mast`.`judgment_date`, `judgment_mast`.`court_name`, `judgment_search_summary`.`act_count`, `judgment_search_summary`.`cited_count`, `judgment_search_summary`.`ref_count`, `judgment_mast`.`judgment_text`, `judgment_mast`.`judgment_abstract`, `judgment_mast`.`disposition_text`, `judgment_mast`.`court_code`, `judgment_mast`.`judgment_code`, `judgment_mast`.`doc_id` FROM `judgment_mast` LEFT JOIN `judgment_search_summary` ON judgment_search_summary.doc_id=judgment_mast.doc_id WHERE judgment_mast.judgment_code IN (1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20) ORDER BY FIELD (judgment_mast.judgment_code, 1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20)
---
            $ids = implode(',', $ids);

//        $conditions=['judgment_code IN '=> $ids];
            $records = JudgmentMast::find()
                    ->asArray()
                    ->select('judgment_mast.appeal_numb,judgment_mast.judgment_title,judgment_mast.judgment_date,judgment_mast.court_name,judgment_search_summary.act_count,judgment_search_summary.cited_count,judgment_search_summary.ref_count,judgment_mast.judgment_text,judgment_mast.judgment_abstract,judgment_mast.disposition_text,judgment_mast.court_code,judgment_mast.judgment_code,judgment_mast.doc_id')
                    ->leftJoin('judgment_search_summary', 'judgment_search_summary.doc_id=judgment_mast.doc_id')
                    ->where("judgment_mast.judgment_code IN (" . $ids . ")")
                    ->orderBy([new \yii\db\Expression('FIELD (judgment_mast.judgment_code, ' . $ids . ')')])
                    ->all();

SELECT `disposition_text`, `disposition_id` FROM `judgment_disposition` WHERE disposition_id IN (0,13,7,2,8,10,32,3,1,26,4,6,29,14,34,23,33,36,19,16,25,17,20,9,31,15,11,12,21,5,35,24,22,18,30,28,27) ORDER BY FIELD (disposition_id, 0,13,7,2,8,10,32,3,1,26,4,6,29,14,34,23,33,36,19,16,25,17,20,9,31,15,11,12,21,5,35,24,22,18,30,28,27)
---
        if (isset($data["disposition_id"]) && count($data["disposition_id"]) > 0):

            $dispositionids = implode(",", array_column($data["disposition_id"], "disposition_id"));
            $dispositionrecords = JudgmentDisposition::find()
                    ->asArray()
                    ->select("disposition_text,disposition_id")
                    ->where("disposition_id IN (" . $dispositionids . ")")
                    ->orderBy([new \yii\db\Expression('FIELD (disposition_id, ' . $dispositionids . ')')])
                    ->all();