common/models/LoginForm.php

    public function login()
    {
       /* $get_limit = Setting::findOne(['name' => 'login_limit']);
$login_limit = 3; //$get_limit->value;*/
//pooja
$login_limit = 3;
$user = $this->getUser();
$active_sess = User::findOne($user->id);
---
SELECT * FROM `user` WHERE `id`=6