frontend/views/site/bareact/complete_bareact.php

SELECT * FROM `bareact_detl` WHERE `doc_id`='1888278'
---
use backend\models\BareactDetl;
$doc_id = $_GET['did'];

//<!-- section display start-->
$bareact = ArrayHelper::map(BareactDetl::find()->where(['doc_id'=>$doc_id])->all(),
    'doc_id','act_title');