backend/models/BareactSubcatgMast.php

SELECT `act_sub_catg_desc`, `act_sub_catg_code` FROM `bareact_subcatg_mast` WHERE `act_catg_code`='21' ORDER BY `act_sub_catg_desc`
---
    public function getBareactCode($act_code){
        $model = BareactSubcatgMast::find()
           ->select('act_sub_catg_desc,act_sub_catg_code')
           ->where(['act_catg_code' => $act_code])
           ->orderBy('act_sub_catg_desc')
           ->all();