backend/models/JudgmentRef.php

SELECT `judgment_title_ref`, `judgment_code` FROM `judgment_ref` WHERE `doc_id_ref`='1000008' GROUP BY `judgment_title_ref`
SELECT COUNT(*) FROM (SELECT * FROM `judgment_ref` WHERE `doc_id_ref`='1000008' GROUP BY `judgment_title_ref`) `c`
---
    public static function getJudgmentCitiedBY($RIdBy){
       /* $data=array('records'=>null,'total'=>0);
        $record=JudgmentRef::find()
            ->asArray()
            ->select(array("judgment_title_ref","judgment_code"))
            ->where(['doc_id_ref' =>$RIdBy])
            ->groupBy("judgment_title_ref")
            ->all();
        $totalRecords= JudgmentRef::find()
            ->asArray()
            ->where(['doc_id_ref' =>$RIdBy])
            ->groupBy("judgment_title_ref")
            ->count();