backend/models/JudgmentAct.php

SELECT `act_title`, `doc_id` FROM `judgment_act` WHERE `j_doc_id`='1000008' GROUP BY `act_title`
SELECT COUNT(*) FROM (SELECT * FROM `judgment_act` WHERE `j_doc_id`='1000008' GROUP BY `act_title`) `c`
---
    public static function getActSections($jDocId)
    {
   $data=array('records'=>null,'total'=>0);

        $record=JudgmentAct::find()
            ->asArray()
            ->select(array("act_title","doc_id"))
            ->where(['j_doc_id' =>$jDocId])
            ->groupBy("act_title")
            ->all();
        $totalRecords= JudgmentAct::find()
            ->asArray()
            ->where(['j_doc_id' =>$jDocId])
            ->groupBy("act_title")
            ->count();

SELECT `judgment_title`, `doc_id`, `judgment_code` FROM `judgment_act` WHERE `j_doc_id`='1000008' GROUP BY `judgment_title`
SELECT COUNT(*) FROM (SELECT * FROM `judgment_act` WHERE `j_doc_id`='1000008' GROUP BY `judgment_title`) `c`
---
    public static function getJudgmentCitied($RId){
        $data=array('records'=>null,'total'=>0);
        $record=JudgmentAct::find()
            ->asArray()
            ->select(array("judgment_title","doc_id","judgment_code"))
            ->where(['j_doc_id' =>$RId])
            ->groupBy("judgment_title")
            ->all();
        $totalRecords= JudgmentAct::find()
            ->asArray()
            ->where(['j_doc_id' =>$RId])
            ->groupBy("judgment_title")
            ->count();