backend/models/JudgmentAdvocate.php

    public static function getAppellant($docId){
        $data=array('records'=>null,'total'=>0);
        $record=JudgmentAdvocate::find()
            ->asArray()
            ->select(['advocate_name'])
            ->where(['doc_id' => $docId])
            ->andWhere(['advocate_flag'=>'A'])
            ->groupBy("advocate_name")
              ->all();
        $totalRecords= JudgmentAdvocate::find()
            ->asArray()
            ->where(['doc_id' => $docId])
            ->andWhere(['advocate_flag'=>'A'])
            ->groupBy("advocate_name")
            ->count();
---
SELECT `advocate_name` FROM `judgment_advocate` WHERE (`doc_id`='1000008') AND (`advocate_flag`='A') GROUP BY `advocate_name`
SELECT COUNT(*) FROM (SELECT * FROM `judgment_advocate` WHERE (`doc_id`='1000008') AND (`advocate_flag`='A') GROUP BY `advocate_name`) `c`

    public static function getRespondant($ResId){
        $data=array('records'=>null,'total'=>0);
        $record=JudgmentAdvocate::find()
            ->asArray()
            ->select(array("advocate_name"))
            ->where(['doc_id' =>$ResId])
            ->andWhere(['advocate_flag'=>"R"])
            ->groupBy("advocate_name")
            ->all();
        $totalRecords= JudgmentAdvocate::find()
            ->asArray()
            ->where(['doc_id' =>$ResId])
            ->andWhere(['advocate_flag'=>"R"])
            ->groupBy("advocate_name")
            ->count();
---
SELECT `advocate_name` FROM `judgment_advocate` WHERE (`doc_id`='1000008') AND (`advocate_flag`='R') GROUP BY `advocate_name`
SELECT COUNT(*) FROM (SELECT * FROM `judgment_advocate` WHERE (`doc_id`='1000008') AND (`advocate_flag`='R') GROUP BY `advocate_name`) `c`