backend/models/JudgmentJudge.php

    public static function getJudges($JId){
        $data=array('records'=>null,'total'=>0);
        $record=JudgmentJudge::find()
            ->asArray()
            ->select(['judge_name'])
            ->where(['doc_id' => $JId])
            ->groupBy("judge_name")
            ->all();
        $totalRecords= JudgmentJudge::find()
            ->asArray()
            ->where(['doc_id' => $JId])
            ->groupBy("judge_name")
            ->count();
---
SELECT `judge_name` FROM `judgment_judge` WHERE `doc_id`='1000008' GROUP BY `judge_name`
SELECT COUNT(*) FROM (SELECT * FROM `judgment_judge` WHERE `doc_id`='1000008' GROUP BY `judge_name`) `c`