frontend/views/site/step2.php

$this->title = 'Update Profile';
    $baseUrl = Yii::$app->params['domainName'];

    $country = ArrayHelper::map(CountryMast::find()->all(), 'country_code', 'country_name');
---
SELECT * FROM `country_mast`


                            </div>
                            <div class="col-md-4 col-xs-12">
                                <?=$form->field($model, 'state_code')->widget(DepDrop::classname(), [
                                    'data'=>ArrayHelper::map(StateMast::find()->all(), 'state_code', 'state_name' ),//will show dependent value while upate //27/07
                                    'options'=>['id'=>'state_code', 'placeholder' => 'Select state'],

                                    'pluginOptions'=>[
                                    'depends'=>['country_code'],
                                    'placeholder'=>'Select state',
                                    'url'=>\yii\helpers\Url::to(['/site/subcat'])
                                     ]
                                    ]);?>
---
SELECT * FROM `state_mast`


                            </div>
                            <div class="col-md-4 col-xs-12">
                                <?=$form->field($model, 'city_code')->widget(DepDrop::classname(), [
                                    'data'=>ArrayHelper::map(CityMast::find()->all(), 'city_code', 'city_name' ),//will show dependent value while upate //27/07
                                    'options'=>['placeholder' => 'Select city'],
                                    'pluginOptions'=>[
                                    'depends'=>['state_code'],
                                    'placeholder'=>'Select city',
                                    'url'=>\yii\helpers\Url::to(['/site/getcity'])
                                    ]
                                ]);?>
---
SELECT * FROM `city_mast`